"Continue" = "Continuar";

"Software Update" = "Actualización de software";
"Release Notes:" = "Notas de la versión";
"Remind Me Later" = "Recuérdamelo más tarde";
"Install on Quit" = "Instalar al salir";
"Install and Relaunch" = "Instalar y reiniciar";
"Skip This Version" = "Saltar esta versión";

"Automatically download and install updates" = "Descargar e instalar las actualizaciones automáticamente";
"No newer version available." = "No hay disponible una version más reciente.";
"An error occurred in retrieving update information. Please try again later." = "An error occurred in retrieving update information. Please try again later.";
"A new version of {0} is available! Would you like to download it now?" = "A new version of {0} is available! Would you like to download it now?";

/* Progress messages */
"Installing update…" = "Instalando actualización…";
"Checking for updates…" = "Comprobando si hay actualizaciones";
"Downloading update…" = "Descargando actualización";
"Extracting update…" = "Extrayendo actualización";

"Version {0} is now available" = "Version {0} is now available";
